CSI API ETABS v1
cLinkObj.GetNameListOnStory Method
 Retrieves the names of the defined link objects on a given story.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameListOnStory(
	string StoryName,
	ref int NumberNames,
	ref string[] MyName
)
Function GetNameListOnStory (
	StoryName As String,
	ByRef NumberNames As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cLinkObj
Dim StoryName As String
Dim NumberNames As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetNameListOnStory(StoryName,
	NumberNames, MyName)
int GetNameListOnStory(
	String^ StoryName,
	int% NumberNames,
	array<String^>^% MyName
)
abstract GetNameListOnStory :
        StoryName : string *
        NumberNames : int byref *
        MyName : string[] byref -> int
Parameters
StoryName
Type: System.String
 The name of an existing story.
NumberNames
Type: System.Int32
The number of link object names retrieved by the program.
MyName
Type: System.String[]
This is a one-dimensional array of link object names. The MyName array is created as a dynamic, zero-based, array by the API user: Dim MyName() as String
The array is dimensioned to (NumberNames - 1) inside the program, filled with the names, and returned to the API user.
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim NumberNames As  Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("2", "4", Name)
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'get link object names
       ret = SapModel.LinkObj.GetNameListOnStory("Story4", NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace